<template>
  <div class="header">
    <div class="header-inner">
      <div class="header-left">
        <slot name="overwrite-left">
          <transition :name="transition">
            <a class="header-back" v-show="_leftOptions.showBack">
              <icon name="arrow-left" @click.native="onClickBack" v-show="_leftOptions.showBack" style="width: 20px; height: 20px"></icon>

            </a>
          </transition>
        </slot>
        <slot name="left"></slot>
      </div>

      <div class="header-title" @click="$emit('on-click-title')" v-if="!shouldOverWriteTitle">
        <slot>
          <div class="title-item">用户协议</div>
        </slot>
      </div>
      <div class="header-title-area" v-if="shouldOverWriteTitle">
        <slot name="overwrite-title"></slot>
      </div>

      <div class="header-right">
        <icon v-if="isShowRefresh" name="refresh" style="width: 24px; height: 24px; margin-top: 10px" @click.native="onClickRefresh"></icon>
        <slot name="right"></slot>
      </div>
    </div>

    <div class="pact">
      <h2>用户注册及服务协议</h2>
<p style="text-indent:2em;">洪才网络科技有限公司（以下简称“服务方”）通过手机应用程序/微信客户端等（以下简称“拉卡贷”）为用户实现直接借贷提供信息搜集、信息公布、信息交互、借贷撮合、合同管理、资金管理等服务（以下简称“拉卡贷服务”）。本《用户注册及服务协议》（以下简称“本协议”）是用户与服务方之间订立的关于用户在拉卡贷进行注册、登录以及使用拉卡贷服务的协议。本协议适用于您在拉卡贷的全部活动。
</p>
    <p style="text-indent:2em;">服务方特别提醒您认真阅读本协议，确保您在注册成为拉卡贷用户前，已充分理解本协议中的所有条款，特别是其中涉及的对服务方免责、对网络借贷风险提示以及对用户权利限制和禁止性行为进行约定的条款。除非您接受本协议所有条款，否则您无权在拉卡贷进行注册、登录或者使用拉卡贷服务。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束，您不得以未签署书面协议为由，否认本协议的效力。服务方有权通过拉卡贷向用户公布关于拉卡贷服务的规则，该等规则构成本协议不可分割的一部分，与本协议具有同等法律效力。
    在本协议履行过程中，服务方有权根据实际情况对本协议的相关条款进行修改，一旦本协议的内容发生变动，服务方将通过拉卡贷公布最新的协议文本。如果用户不同意服务方对本协议所做的任何修改，用户有权停止使用拉卡贷服务。如果用户继续使用拉卡贷服务，则视为用户接受服务方对本协议所做的修改，并应遵照修改后的协议履行应尽义务。</p>
<h4>第一条 用户注册</h4>
 1.1  在使用拉卡贷服务前，用户必须先在拉卡贷上进行注册。注册用户必须是中华人民共和国境内（不包括中华人民共和国香港特别行政区、澳门特别行政区及台湾地区）具有完全民事权利能力和民事行为能力，能够独立承担民事责任的自然人。用户不具备上述资格的，应当立即终止注册、登录以及停止使用拉卡贷服务，否则，用户的监护人应当承担一切法律责任。服务方有权对不具备注册资格的用户随时终止注册、登录以及停止提供拉卡贷服务，造成损失的，用户及其监护人应当承担赔偿责任。
<br/>
1.2 用户应当使用尚未注册的手机号码在拉卡贷进行注册,并设置相应的密码。注册成功后，用户将取得一个与其注册所用手机号码对应的拉卡贷账号。拉卡贷账号及密码由用户负责保管，用户应当对通过其拉卡贷账号进行的所有活动承担法律责任。任何经由用户拉卡贷账号发出的指令均视为用户本人的行为和真实意思表示，由此产生的一切责任和后果由用户本人承担。
<br/>
1.3 拉卡贷服务的部分内容需要用户根据要求完成身份认证及/或银行卡认证，未进行身份认证及/或银行卡认证的用户将无法使用该部分拉卡贷服务。因未能完成认证而无法享受拉卡贷服务造成的损失，服务方不承担任何责任。
<br/>
1.4 用户有义务提供有效的联系方式，包括但不限于手机号码、常用电子邮箱、联系地址等。联系方式发生变更时，用户应当在3日内进行更新。因用户操作不当或填写的联系方式有误，导致服务方无法正常提供拉卡贷服务的，造成的损失及法律后果由用户自行承担。
<br/>
1.5 如用户发现有他人冒用或盗用其拉卡贷账号及密码，或进行任何其他未经其合法授权行为的，应立即以书面方式通知拉卡贷并要求暂停服务，拉卡贷将积极响应用户的要求。用户应当理解，对用户的要求采取行动需要合理期限，在此之前，拉卡贷对已执行的指令及/或所导致的用户损失不承担任何责任。
<br/>
<h4>第二条 服务内容</h4>
2.1 服务方将恪尽职守，本着依法、诚实、信用、自愿、公平、谨慎、有效管理的原则，为用户提供信息搜集、信息公布、信息交互、借贷撮合、合同管理、资金管理等服务。服务方向用户提供服务的具体内容，以本协议、服务方与用户签订的网络借贷交易相关协议以及服务方通过拉卡贷不时公布的规则为准。
<br/>
2.2 为向用户提供拉卡贷服务，服务方会要求用户通过拉卡贷提供和上传个人资料信息，用户有义务确保其提供的个人资料信息的真实性、准确性和完整性，并承诺对个人资料信息及时进行更新。如服务方基于合理判断认定用户提供的个人资料信息存在错误、虚假、不完整或未及时更新的，服务方有权立即单方面终止用户拉卡贷账号的使用、拒绝用户使用全部或者部分拉卡贷服务。在此情况下，服务方不承担任何责任，并且用户同意负担因此所产生的直接或间接的任何支出或损失。
<br/>
2.3 基于用户通过拉卡贷提供的个人资料信息，服务方将从用户在拉卡贷的活动追踪或者自行从公开渠道、第三方渠道或私人渠道等合法渠道收集用户其他个人资料信息。用户授权服务方通过上述渠道追踪、收集其个人资料信息，并授权服务方根据用户提供的及服务方自行追踪、收集的各项信息，对用户的财务状况、投资经验、风险偏好、风险承受能力等进行尽职评估以及根据评估结果对用户实行分级管理。
<br/>
2.4 为撮合用户与借款人达成网络借贷交易，服务方将对借款人的借款需求及相关信息进行必要审核，并自主决定是否将借款人的借款需求及相关信息通过拉卡贷进行公布。用户同意并知悉服务方不对发布信息的真实性、准确性、完整性和合法性作出保证，服务方将依据相关法律法规的要求对于网络借贷有关信息进行披露，但用户与交易对方之间因交易发生的或与交易有关的任何纠纷，应由纠纷各方自行解决，网络借贷交易风险应由用户与交易对方各自承担，服务方不承担任何交易风险及法律责任。
<br/>
2.5 用户应当参考服务方公布的借款人的借款需求及相关信息，并根据自身投资偏好及风险承受能力自主决定或者授权服务方代其决定是否与借款人达成网络借贷交易、签订相关协议。用户应当自行承担网络借贷交易中出借人的责任与风险，服务方不承担任何交易风险及法律责任。
<br/>
2.6 通过拉卡贷促成的网络借贷交易采用电子合同方式。用户以拉卡贷账号在拉卡贷通过点击确认或类似方式签署的电子合同即视为用户本人真实意思表示，具有法律效力。用户应妥善保管自己的拉卡贷账号和密码，用户通过前述方式订立的电子合同对合同各方具有法律约束力，用户不得以其拉卡贷账号和密码被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。服务方向用户提供电子合同和电子账单的备案、查阅和发送服务。用户在拉卡贷绑定的电子邮箱作为其电子合同及其他重要通知的接收邮箱，用户应当在注册成功后尽快绑定电子邮箱并密切关注邮箱信息。
<br/>
2.7 为确保网络借贷交易便捷、安全，服务方会根据交易需要使用专业认证机构提供的电子签章完成网络借贷交易文件签署及交易行为确认。用户同意授权服务方将用户相关信息提交至专业认证机构，代其申请专属于用户的电子签章，该等电子签章将被作为在拉卡贷签署电子合同等法律文本之目的使用。
<br/>
2.8 为确保网络借贷交易的资金安全，服务方会根据交易需要委托存管银行或第三方支付机构开立交易结算资金账户，并通过该账户为用户提供资金保管、资金充值、资金冻结、资金代付、资金代收、资金提取、资金查询等资金管理服务。用户知悉并授权服务方将用户相关信息提供给存管银行或第三方支付机构，由存管银行或第三方支付机构进行账户开立、资金管理服务等操作。用户确认，其资金留存于存管银行账户期间产生的银行存款利息归服务方所有。
<br/>
2.9 用户知悉并同意，服务方提供的资金管理服务基于与存管银行或第三方支付机构开展的合作，服务方不对银行及第三方支付机构进行资金划转的时效性、准确性等作出任何承诺或承担任何相关责任，包括但不限于由此产生的利息损失、货币贬值，也不承担因银行及第三方支付机构执行划转指令出现错误、系统故障、银行及第三方支付机构对资金划转的特定限制等导致的损失或责任。
<br/>
2.10 用户了解并同意，其为进行交易所发出的任何指示或指令，均为不可撤销、不可逆转的指示或指令，用户不能以任何理由拒绝付款或要求取消交易。
<br/>
<h4>第三条 服务费及其他费用</h4>
3.1 用户使用拉卡贷服务时，服务方有权向用户收取相关服务费用。收费标准详见服务方与用户签署的网络借贷交易相关协议以及服务方通过拉卡贷不时公布的收费说明。服务方有权根据国家法律法规、行业政策、业务发展、市场情况等因素单方面制定及调整服务费用的收费标准，前述收费标准一经调整，服务方将会通过拉卡贷进行及时公布和通知。
<br/>
3.2 银行或第三方支付机构对本协议约定的资金管理服务收取费用的，该费用由用户自行支付。用户同意将根据银行或第三方支付机构制定的收费标准，自行或委托服务方及/或其合作方代为向银行或第三方支付机构支付。由该费用支付事项产生的任何争议、纠纷等，均由用户与银行或第三方支付机构自行解决，服务方及/或其合作方不承担因此而产生的任何损失或责任。
<br/>
第四条 用户信息及隐私保护
4.1 为了更加充分的了解用户情况，以便向用户提供更好的信息搜集、信息公布、信息交互、借贷撮合、合同管理、资金管理等相关服务，用户充分理解并授权，服务方有权从用户在拉卡贷的活动追踪用户个人资料信息，以及自行通过其他公开渠道、第三方渠道或私人渠道等合法渠道查询、收集用户个人资料信息。
<br/>
4.2 用户授权服务方，基于履行协议、提供服务、解决争议、保障交易安全、控制交易风险等目的，对于用户提供的个人资料信息、从用户在拉卡贷的活动所追踪的用户个人资料信息以及通过其他方式自行收集的用户个人资料信息，享有合理使用、披露的权利。
<br/>
4.3 用户授权服务方及其关联方，在不透露用户个人隐私资料的前提下，有权对整个用户数据库进行分析并对用户数据库进行商业利用。
<br/>
4.4 基于服务用户之目的，服务方有权通过使用和分析用户的个人资料信息和用户手机上装载的所有应用程序种类名称信息等，向用户提供其可能感兴趣的产品或服务信息；或在服务方的关联方及/或合作方同意承担与服务方同等的保护用户隐私责任的情况下，与服务方的关联方或合作方共享信息，以便关联方或合作方向用户展示其产品或服务信息。
<br/>
4.5 服务方对于用户提供的以及其自行追踪、收集的用户个人资料信息，不会恶意出售或免费共享给任何第三人。但在下列情形下，服务方有权依法或根据约定在必要范围内披露用户个人资料信息：
<br/>
4.5.1 根据法律法规、司法程序或政府机关、司法机关、行业协会（包括但不限于中国互联网金融协会、北京市互联网金融行业协会）的要求报送相关信息；
<br/>
4.5.2 为建立信用体系，服务方有权将用户个人资料信息提供给依法设立的征信机构、信用评级机构、资信评估机构等类似机构；
<br/>
4.5.3 为核实用户个人资料信息的准确性，与第三方机构进行交叉验证（包括但不限于将用户身份信息与依法设立的征信机构或第三方机构进行交叉验证以完成用户实名身份认证，用户授权此类依法成立的征信机构或第三方机构向有关合法机构采集用户本人的身份信息以完成用户实名身份认证）；
<br/>
4.5.4 事先获得用户同意或授权的其他情形。
<br/>
4.6 借款人同意并授权服务方向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会报送借款人信用信息，报送的信用信息包括但不限于负债信息及偿债履约能力判断信息。
<br/>
4.7 借款人授权服务方可在本人借款信息服务业务申请阶段及业务存续期间向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会查询本人的信用信息，查询的信用信息包括但不限于负债信息及偿债履约能力判断信息。
<br/>
4.8 服务方将按照法律法规、行业标准和惯例，采取合理、必要的手段及措施对用户提供的、其自行追踪、收集的用户个人资料信息进行保护。用户应当理解，保护措施可能受限于技术水平而不能完全确保用户个人资料信息不会通过本协议中未列明的途径泄露出去。针对本条款约定情形下的个人资料信息使用及披露有可能给用户造成的损失，服务方不承担任何责任。
<br/>
4.9 本条款所称服务方的“关联方”指在资金、经营、购销等方面与服务方存在直接或者间接的拥有或者控制关系的企业；或与服务方直接或者间接地同为第三者所拥有或者控制的企业；或与服务方在利益上具有相关联的其他关系的企业。上述“关联方”包括但不限于小爱有信数据科技有限公司、量化空间信息技术（北京）有限公司、凡普金科集团有限公司、凡普金科企业发展（上海）有限公司、北京会牛科技有限公司、北京分母互动科技有限公司、北京秋成科技有限公司。
<br/>
4.10 本条款所约定的用户授权及隐私保护内容，具有独立法律效力并永久持续有效，不因本协议效力状态的变化而变化，也不因拉卡贷相关交易规则或网络借贷交易相关协议的变更、解除或终止而变化。
<br/>
<h4>第五条 用户的承诺及义务</h4>
5.1 用户承诺绝不以任何非法目的或以任何非法方式使用拉卡贷服务，并承诺遵守法律法规及其他规范性文件，遵守所有与拉卡贷服务有关的协议和规则。因违背上述承诺造成的损失及后果，用户自行承担全部责任。
<br/>
5.2 用户承诺其出借资金为合法、安全的自有资金，不存在不诚实经营、诈骗客户资金等违法经营行为所得或盗窃、诈骗、毒品交易、黑社会组织性质不法行为、受贿、侵占挪用公司财产等犯罪行为所得，不存在通过拉卡贷进行出借等洗钱行为来掩饰资金非法来源，获取不法收益的行为。如果第三人对资金归属、合法性问题发生争议，由用户负责解决并自行承担相关责任，用户未能妥善解决、达成书面协议或在法院裁判生效之前，服务方有权决定冻结用户的本金及利息收益。
<br/>
5.3 用户承诺不得利用拉卡贷服务侵害他人合法权益，进行违法或不正当的活动，包括但不限于：
<br/>
5.3.1 侵害他人名誉、隐私权、商业秘密、商标权、著作权等知识产权及其他权益；
<br/>
5.3.2 违反依照法律规定或协议约定应当承担的保密义务；
<br/>
5.3.3 冒用他人名义使用拉卡贷服务；
<br/>
5.3.4 利用网络借贷交易资金及所得收益从事任何不法活动，如贩卖枪支、毒品、盗版软件或其他违禁物，反国家、恐怖融资等违法犯罪活动，或以网络借贷交易资金及所得收益支持、资助或变相帮助反国家、恐怖组织用于非法活动；
<br/>
5.3.5 涉嫌洗钱、套现或进行传销活动；
<br/>
5.3.6 从事任何可能含有电脑病毒或者可能侵害拉卡贷服务系統、资料等行为；
<br/>
5.3.7 利用拉卡贷服务系统进行可能对互联网或移动通讯设备正常运转造成不利影响的行为；
<br/>
5.3.8 侵犯服务方的商业利益，泄露商业机密；
<br/>
5.3.9 利用拉卡贷服务上传、展示或传播虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；
<br/>
5.3.10 其他拉卡贷有正当理由认为不适当的行为。
<br/>
5.4 用户违反本协议或网络借贷交易相关协议的约定，导致任何第三方向服务方主张任何索赔要求的，服务方有权要求用户进行赔偿，并视用户行为的性质，采取包括但不限于删除用户发布信息内容、暂停使用许可、终止服务、限制使用、回收拉卡贷账号、追究法律责任在内的各项措施。对恶意注册拉卡贷账号或利用拉卡贷账号进行违法活动、侵犯第三方合法权益的，服务方有权回收其拉卡贷账号，将违法行为及有关信息资料进行公示、计入用户信用档案、按照法律规定提供给有关政府机构或按照协议约定提供给第三方；构成犯罪的，服务方将根据司法部门的要求，协助调查。
<br/>
5.5 用户不得对本协议及拉卡贷服务的任何部分，以及基于本协议或拉卡贷服务之使用而获得的其他用户和交易对方信息或商业机密，进行出售或用于任何其它商业目的。
<br/>
第六条 风险提示
6.1 用户了解并认可，任何通过拉卡贷进行的网络借贷交易并不能避免以下风险的产生,用户应当了解网络借贷交易风险，具备相应的投资风险意识、风险识别能力和风险承受能力，服务方不能也没有义务为如下风险承担责任。
<br/>
6.1.1 法律及监管风险：因许多法律和法规相对较新且可能发生变化，相关官方解释和执行可能存在较大不确定性等因素引起的风险。有些新制定的法律、法规或修正案的生效可能被延迟；有些新颁布或生效的法律法规可能具有追溯力从而对用户的投资利益造成不利影响。
<br/>
6.1.2 政策风险：因国家宏观政策、财政政策、货币政策、监管导向、行业政策、地区发展政策等因素引起的风险。
<br/>
6.1.3 市场风险：因市场资金面紧张或利率波动、行业不景气、企业效益下滑等因素引起的风险。
<br/>
6.1.4 借款人信用风险：针对拉卡贷上的债权，服务方仅在债权形成前对借款人的借款需求及相关信息进行必要审核，但是服务方不对借款人的还款能力做出任何明示或默示的担保或保证，并且如果发生债权转让，服务方不会在债权转让时再次对借款人进行信用审核，用户受让的债权可能在其受让前已经存在逾期情况。当借款人因收入情况、财产状况发生变化、人身出现意外、发生疾病、死亡等情况，短期或者长期丧失还款能力，或者借款人的还款意愿发生变化时，您的出借资金可能无法按时回收甚至无法回收，您的预期收益可能无法实现。服务方没有义务对对逾期的本息以及费用进行垫付或未经委托对借款人进行追索。
<br/>
6.1.5 资金流动性风险：针对用户的出借本金或者回款再出借资金，服务方会积极协助用户寻找、推荐借款人，以完成资金出借、获取收益之目的，但服务方寻找、推荐借款人的时间存在一定不确定性。同时，服务方将在用户提出需要时，努力帮助用户寻找、向用户推荐愿意受让债权的第三方，以完成债权转让，但服务方不对债权转让的实现以及实现时间做出任何承诺和保证。
<br/>
6.1.6 技术风险：由于无法控制和不可预测的系统故障、设备故障、通讯故障、电力故障、网络故障、黑客或计算机病毒攻击、以及其它因素，可能导致用户出现非正常运行或者瘫痪，由此导致用户无法及时进行查询、充值、出借、提现等操作。
<br/>
6.1.7 不可抗力风险：由于战争、动乱、自然灾害等不可抗力因素的出现而可能导致您出借资金损失的风险。
<br/>
<h4>第七条 免责条款</h4>
7.1 用户确认，服务方根据本协议的约定向用户提供的所有服务仅供用户决定是否出借资金时予以参考，服务方未对借款人的还款能力及网络借贷交易相关协议的履行作出任何明示或默示的担保，亦不对用户的本金及收益作出明示或默示的保证或承诺保本保息。
<br/>
7.2 服务方对所有服务将尽力维护其安全性及方便性，但由于互联网服务的特殊性，服务方对服务中出现的中断、信息删除或储存失败等，不承担任何责任。
<br/>
7.3 使用互联网服务可能会受到各个环节不稳定因素的影响，存在因不可抗力、计算机病毒、黑客攻击、系统不稳定、用户所在位置、用户关机或手机感染病毒以及其他任何网络、技术、通信线路等原因造成的服务中断或不能满足用户要求的风险，用户需充分理解并自行承担上述风险，服务方不承担任何责任。
<br/>
7.4 用户因第三方如电信部门的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的经济损失，服务方不承担任何责任。
<br/>
7.5 服务方的合作方提供的服务内容由该合作方负责。用户享用相关服务时产生的争议、纠纷及损失，服务方不承担任何责任。
<br/>
<h4>第八条 知识产权保护</h4>
8.1 拉卡贷程序及其上内容的知识产权均由服务方依法拥有，包括但不限于文字、软件、声音、图片、录像、图表等，除非事先经服务方的合法授权，任何人皆不得擅自以任何形式使用、修改、复制、公开发布拉卡贷程序或/及其上内容，或者创造与内容有关的派生产品。
<br/>
8.2 用户必须依法尊重服务方的知识产权，否则，服务方有权立即终止向用户提供服务，并依法追究其法律责任，要求用户赔偿拉卡贷一切损失。
<br/>
<h4>第九条 通知</h4>
9.1 本协议项下的通知如以在拉卡贷公示方式作出，一经在公示即视为已经送达。除此之外，其他向用户发布的具有专属性的通知将由服务方向用户提供的手机号码、电子邮箱或用户在拉卡贷的站内消息系统栏发送，一经发送即视为已经送达。用户应当密切关注手机短息、电子邮件及拉卡贷的站内消息，用户不得以未收到或未阅读该等通知而主张相关通知未予送达。
<br/>
<h4>第十条 其他条款</h4>
10.1 本协议自用户成功注册为拉卡贷用户之日起生效，除服务方终止本协议或用户丧失拉卡贷注册用户资格外，本协议始终有效。出于运行和交易安全的需要，服务方有权暂时停止提供或者限制拉卡贷服务的部分功能，或提供新功能，在任何功能减少、增加或者变化时，只要用户仍然使用拉卡贷服务，则表示用户仍然同意本协议或变更后的协议。
<br/>
10.2 本协议终止并不免除用户根据本协议或网络借贷交易相关协议已经发生的行为或达成的网络借贷交易项下所应承担的义务和责任。
<br/>
10.3 服务方未行使或执行本协议中约定的任何权利或规定，不构成对该权利的放弃。
<br/>
10.4 本协议的订立、执行和解释适用中华人民共和国法律。如本协议的任何条款与适时法律规定相抵触或因任何其他原因而不具有可执行性，则该条款无效，但并不影响本协议其他条款继续有效。
<br/>
10.5 若用户和服务方之间发生任何纠纷和争议，应友好协商解决，协商不成，用户同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。
<br/>
10.6 本协议签订地为中华人民共和国北京市东城区。
<br/>
10.7 本协议最终解释权归服务方所有，在法律法规允许的范围内，服务方保留一切解释和修改的权利。
<br/>
<br/>
<br/>
Copyright ©2018-2019 洪才网络科技有限公司

    </div>

  </div>
</template>


<script>
import objectAssign from "object-assign";
import bus from "@/libs/bus";
export default {
  name: "rg-header",
  props: {
    leftOptions: Object,
    // title: String,
    transition: String,
    rightOptions: {
      type: Object,
      default() {
        return {
          showMore: false
        };
      }
    }
  },
  beforeMount() {
    // bus.$on("toggleHeaderRefresh", (value) => {
    //   this.isShowRefresh = value;
    // }); // 刷新按钮是否显示的注册
    // if (this.$slots["overwrite-title"]) {
    //   this.shouldOverWriteTitle = true;
    // }
    // this.title1 = this.title;
  },
  data() {
    return {
      isShowRefresh: false,
      shouldOverWriteTitle: false,
      title: ""
    }
  },
  computed: {
    _leftOptions() {
      return objectAssign(
        {
          showBack: true,
          preventGoBack: false
        },
        this.leftOptions || {}
      );
    }
  },
  methods: {
    onClickBack() {
      if (this._leftOptions.preventGoBack) {
        this.$emit("on-click-back");
      } else {
        this.$router.go(-1);
        //					this.$router ? this.$router.back() : window.history.back()
      }
    },
    onClickRefresh() {
      bus.$emit("clickHeaderRefresh");
    }
  },
  beforeDestroy() {
    bus.$off("toggleHeaderRefresh");
  }
};
</script>

<style lang="stylus" scoped>

@import '../style/variable/index.styl'
$header-background-color = #FFFFFF
$header-title-color = #4C4C4C // 标题颜色
$header-text-color = #fff // 文字颜色
$header-arrow-color = #4C4C4C // 箭头颜色
$header-height = 44px // 标题高度
$header-left-right-width = 72px // 左右的宽度
.header
  padding 0 $gap-default
  background-color $header-background-color
  height $header-height
.header-inner
  padding 0 $header-left-right-width
  height 100%
  position relative
  span
    display inline-block
.header-title-area, .header-title
  height $header-height
  width auto
  overflow hidden
  text-overflow ellipsis
  white-space nowrap
.header-title
  position relative
  line-height $header-height
  text-align center
  font-size 18px
  font-weight 400
  color $header-title-color
  .title-item
    position absolute
    width 100%
    height 100%
    left 0
    top 0
.header-left, .header-right
  position absolute
  width $header-left-right-width
  height 100%
  top 0
  display block
  font-size 14px
  color $header-text-color
  a, button
    display inline-block
    color $header-text-color
    &:active
      opacity 0.5
.header-left
  left 0
  text-align left
  $back-height = 20px
  $arrow-width = 12px
  $arrow-height = $arrow-width
  .header-back
    position relative
    height $back-height
    top ($header-height - $back-height) * 0.5
    line-height $back-height
    .left-arrow
      height 100%
      padding-left $arrow-width
      &:before
        content ''
        position absolute
        width $arrow-width
        height $arrow-height
        border-style solid
        border-color $header-arrow-color
        border-width 1px 0 0 1px
        transform rotate(315deg)
        top 8px
        left 2px
.header-right
  text-align right
  right 0
  $header-more-height = 30px
  .header-more
    position relative
    top ($header-height - $header-more-height) * 0.5
    height $header-more-height
    line-height $header-more-height
    &:after
      content '\2022\0020\2022\0020\2022\0020'
      font-size 16px
.svg-icon
  color #4C4C4C
// /////////////////////////////////////////////////
$animation-duration = 0.38s
$animation-x = 100px
.slide-fade-right-enter-active
  animation fadeInRight $animation-duration
.slide-fade-right-leave-active
  animation fadeOutRight $animation-duration
.slide-fade-left-enter-active
  animation fadeInLeft $animation-duration
.slide-fade-left-leave-active
  animation fadeOutLeft $animation-duration
@keyframes fadeInRight
  0%
    opacity 0
    transform translateX($animation-x)
  100%
    opacity 1
    transform translateX(0)
@keyframes fadeOutRight
  0%
    opacity 1
    transform translateX(0)
  100%
    opacity 0
    transform translateX((-($animation-x)))
@keyframes fadeInLeft
  0%
    opacity 0
    transform translateX((-($animation-x)))
  100%
    opacity 1
    transform translateX(0)
@keyframes fadeOutLeft
  0%
    opacity 1
    transform translateX(0)
  100%
    opacity 0
    transform translateX($animation-x)
.pact
  text-align left
  font-size 16px
</style>
